<?xml version="1.0" encoding="utf-8" ?>
<!DOCTYPE section PUBLIC "-//OASIS//DTD Simplified DocBook XML V1.0//EN" "http://www.oasis-open.org/docbook/xml/simple/1.0/sdocbook.dtd">
<section>

  <title>&Uuml;berblick des GeneSEZ Ansatzes</title>

  <para>Basierend auf dem GeneSEZ Metamodell entstand eine 
  MDSD-Plattform die in <xref linkend="de.genesez.intro.overview"/> 
  schematisch dargestellt ist.</para>

  <figure id="de.genesez.intro.overview">

    <title>Schematischer &Uuml;berblick des GeneSEZ Ansatzes</title>

    <mediaobject><imageobject role="html"><imagedata align="center"
     fileref="de.genesez.intro.overview.png"/></imageobject>
    <imageobject role="fo"><imagedata align="center"
     fileref="core/intro/de.genesez.intro.overview.png" scalefit="1"
     width="100%"/></imageobject></mediaobject>
  </figure>

  <para>Dabei sind f&uuml;r den Hauptbestandteil die folgenden Konzepte 
  charakteristisch:</para>

  <itemizedlist>

    <listitem>

      <para>Das GeneSEZ Core Metamodell als zentraler Bestandteil 
      welches die Informationen zur Quellcodegenerierung in 
      aufbereiteter Form zur Verf&uuml;gung stellt und f&uuml;r 
      Modelltransformationen genutzt wird.</para>

    </listitem>

    <listitem>

      <para>Modelladapter werden genutzt um GeneSEZ Modelle mit 
      Informationen aus Anwendungsmodellen zu erstellen.</para>

    </listitem>

    <listitem>

      <para>Die GeneSEZ Komponenten als Funktionsbibliothek sowie als 
      gemeinsame Basis f&uuml;r die Erzeugung von Quellcode f&uuml;r verschiedene 
      Programmiersprachen.</para>

    </listitem>

    <listitem>

      <para>Die Plattformprojekte stellen Quellcodeschablonen 
      (Templates) f&uuml;r die jeweiligen Programmiersprachen, sowie 
      Libraries und Frameworks zur Quellcodegenerierung bereit.</para>

    </listitem>

  </itemizedlist>

  <para>Anwendungsmodelle k&ouml;nnen dabei unabh&auml;ngig von der 
  MDSD-Plattform erstellt und ausgearbeitet werden. Durch Modelladapter 
  werden die f&uuml;r die Quellcodegenerierung notwendigen Informationen aus 
  den Anwendungsmodellen extrahiert und in GeneSEZ Modelle &uuml;berf&uuml;hrt. 
  Basierend auf diesen GeneSEZ Modellen k&ouml;nnen weitere 
  Modelltransformationen erfolgen bis letztendlich eine Modell-zu-Text 
  Transformation die Quellcodegenerierung durchf&uuml;hrt und automatisch 
  Quellcodeartefakte erzeugt. Meist kann der Quellcode nicht sinnvoll 
  vollst&auml;ndig erzeugt werden, wodurch dieser mit manueller 
  Implementierung noch vervollst&auml;ndigt wird.</para>

  <para>Dabei ist es nicht notwendig diese Schritte nacheinander 
  abzuarbeiten. Ist eine erste Version des Anwendungsmodells verf&uuml;gbar 
  so kann dieses in ein GeneSEZ Modell &uuml;berf&uuml;hrt werden und 
  anschlie&szlig;end Quellcode erzeugt werden. Dieser kann auch bereits mit 
  manueller Implementierung erg&auml;nzt werden. W&auml;hrend das 
  Anwendungsmodell weiter ausgearbeitet wird, kann dieses regelm&auml;&szlig;ig in 
  Quellcode transformiert werden wobei die manuelle Implementierung 
  erhalten bleibt. Dieses iterative Vorgehen erlaubt den R&uuml;ckfluss an 
  Informationen die aus der Implementierung entstehen zur 
  Anwendungsmodellierung wo diese zur Verbesserung des 
  Anwendungsmodells beitragen k&ouml;nnen.</para>

  <para>Ein wesentlicher Vorteil bei der Entwicklung von 
  Modelltransformationen ist die M&ouml;glichkeit das GeneSEZ Metamodell auf 
  zwei A4 Seiten vollst&auml;ndig auszudrucken und als &Uuml;bersicht zu nutzen, 
  wie auf bestimmte Informationen zugegriffen werden kann.</para>

</section>

